# DoorFrameType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DoorFrameType Property
ParameterTypeId Class See Also
---
"Frame Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DoorFrameType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DoorFrameType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DoorFrameType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace